{
  "title": "PAPER",
  "sections": [
    {
      "heading": "CHOOSING THE RIGHT LEARNING MANAGEMENT SYSTEM (LMS) FOR THE HIGHER EDUCATION INSTITUTION CONTEXT…"
    },
    {
      "heading": "Choosing the Right Learning Management System (LMS) for the Higher Education Institution Context: A Systematic Review",
      "text": "http://dx.doi.org/10.3991/ijet.v11i06.5644\n\nN. N. M. Kasim, F. Khalid\n\nUniversiti Kebangsaan Malaysia, Bangi, Malaysia\n\nAbstract—A Learning Management System (LMS) is one e-learning tool that has been widely used to improve students’ learning experience and the construction of their understanding of certain topics. This concept paper discusses a number of potential Learning Management Systems (LMS) that can be utilised for teaching and learning processes in the context of Higher Education Institutions, for example Moodle, ATutor, Blackboard and SuccessFactors. The comparison is made based on a literature review of the characteristics of the selected LMS providers. Among the characteristics considered are flexibility, ease of use, accessibility and user friendliness. This paper also provides some conclusions on the selection of the platform to be used. The results of this study give readers information to make their own decisions when choosing an LMS platform based on the needs of their institution.\n\nIndex Terms—Learning Management System; e-learning; higher education institution; characteristics of LMS"
    },
    {
      "heading": "I. INTRODUCTION",
      "text": "In recent years, the use of Information and Communication Technology (ICT) in the everyday life of an individual has expanded. This is because the need for ICT to shape education institutions is running in parallel to technological innovations of technology and twenty-first century learning. The Malaysia Education Blueprint 2013-2025, locally known as Pelan Pembangunan Pendidikan Malaysia (PPPM), demands that all institutions improve learning quality in Malaysia by improving internet access and online learning environments, by augmenting online content to share best practices, and by maximising the use of ICT for distance and self-paced learning to expand the capacity and quality of learning [1].\n\nThe Malaysian National Policy on e-Learning in Higher Education Institutions refers to the initiative to provide a quality education framework and e-learning direction regarding the concept of ‘One Malaysia’ and the New Economic Model (Model Baru Ekonomi– MBE) [2]. Reference [3] state that the use of e-learning can give various benefits to teaching and in terms of the use of technology and pedagogy. E-learning integrates the main components of e-learning, such as Learning Management Systems (LMS), content management systems and learning-content management systems [4]. As technology in education is developing, many specialists in the ICT field are introducing new tools for online learning into the classroom, which are changing the learning environment. Internet technology affects students’ learning and teachers’ performance using online networks to link between teachers and students, between students, and also between students.\n\nLearning Management Systems are also platforms that include learning systems, course management systems, content management systems, portals, and instructional management systems [9]. Learning Management Systems represent an evolution from the processes and systems developed by certain institutions to register students on specific courses and keep records of students’ activities. Various learning choices developed to enable students to take online courses, sometimes as part of the formal curriculum and sometimes due to the need for institutional certification. LMS can also help students to access learning information via course guidelines, uploading assignments and downloading marks, active interactions between students and lecturers, interactions between students, interactions between students and learning tools, sharing knowledge, and taking online exams and quizzes [10].\n\nIn Malaysia, higher education institutions (HEIs) have developed various LMS as a medium for learning and interactive online teaching. In addition to meeting face-to-face in the classroom, LMS also facilitate communication between the lecturer and the students, and communication between students. Examples of LMS are Moodle, i-Folio, Claroline, MyGuru2, Learning Care, iLearn System, Learning Cube, Blackboard, PutraLMS and MyLMS [11], which integrate various pedagogical and course administration tools [9]. LMS platforms are open source, which means that each LMS has its own characteristics and can be modified by the institution according to its needs. As LMS technology has developed over time, different types of LMS have been developed, such as Sistem Maklumat Sumber Manusia (HRIS), and Perancangan Sumber Perusahaan (ERP). Both systems can be used to analyse different types of LMS.\n\niJET ‒ Volume 11, Issue 6, 2016\n\n55\n\n\n\n\nnadirah_proof read - Microsoft Word"
    },
    {
      "heading": "CHOOSING THE RIGHT LEARNING MANAGEMENT SYSTEM FOR THE HIGHER EDUCATION INSTITUTION CONTEXT",
      "text": "Keywords: Learning Management System (LMS)\n\nfor skills-gaps in students’ performance, and also for competency mapping [12]. There are various types"
    },
    {
      "heading": "B. Content Management System (CMS)",
      "text": "A Content Management System (CMS) can be defined by three dimensions: content, process, and technology or software [13]. Reference [14] states that the content on a CMS can be text, graphical, animation, sound, video, or any media system. Meanwhile, the process is a set of activities that take one or more inputs and react to them to produce the output; for example, downloading documents, publishing and sharing information [15]. Technology or software can be defined as means of implementing users’ process and controlling the content via the internet [16].\n\nThere are various types of CMS, such as CMS Enterprise, CMS Component, CMS Web, document management, record management and others. CMS Enterprise comprises a strategy, tools and processes that enable all the employees within a company to access, manage, and check documents, templates, media and other information assets [17]. Meanwhile, CMS Component is a database and software program that allows users to save, access, edit, and manage the content topic levels. It is often used for DITA content (XML) because it manages the connections millions of components [18]. CMS Web is an LMS that is designed to enable publishing web content one site where content creators can edit, send and present their content without needing to be familiar with Hypertext Markup Language (HTML) [19]."
    },
    {
      "heading": "C. Learning Content Management System (LCMS)",
      "text": "Nowadays, most of the systems that are widely used in the education field can be described as Learning Content Management Systems (LCMS). This refers to an environment of various users in which the educator can create, store, reuse, manage and present digital learning content from the centre of the repository object [20]. These systems provide the tools for the teacher to present and manage assignments synchronously and asynchronously, based on the learning methodology. Most LCMS provide basic LMS functions and several content management functions. In addition, most LMS, CMS and LCMS use the Shareable Content Object Reference Model (SCORM) standard, which controls how the online learning content and learning management systems communicate with each other. Ref. [21] states that SCORM is a set of technical standards for the production of e-Learning software. SCORM tells the programmer how to write their code so that it can be used with other e-Learning software. In a nutshell, SCORM controls how the online learning content and learning management systems communicate with each other.\n\nThe main purpose of LCMS is to manage the digital assets that are used to develop the learning products [10]. These systems have databases known as learning content repository objects, which stores the works of the lecturer specifically for learning purposes. In addition, these systems can be accessed by the same lecturer or other lecturers for new learning development purposes, including the provision of suitable work-charts to update the content, the ability to write courses, cooperation tools that allow the lecturer and the students to work together, several basic functions of LMS and ways to compose and administrate exams and quizzes."
    },
    {
      "heading": "D. Types of Tools in Learning Management Systems (LMS)",
      "text": "Based on a literature review of past studies, LMS can be categorised into three main types: learning skills tools, communication tools, and productivity tools [22];[8];[15]. An example of a tool for learning skills is learning module that create activities and learning tools for students. These tools could include quizzes, online presentation tools and assignments. A quiz module would have many functions like a question database, a response facility, a marking scheme, and a means of facilitating students’ performance. Meanwhile, the online presentation tool facilitates presentations to be uploaded to the LMS or linked from websites like YouTube [22]. For assignments, the lecturer will upload the assignment to the LMS, students will do the assignment online and can edit or send the assignment any time until the date of submission.\n\nThe second category is communication tools. These tools enable interaction between lecturers and students, and interaction between students. The most common communication tool is announcements, which are used for presenting any information regarding the course, including the latest news and upcoming activities, to all the students. In addition, discussions are also included as communication tools, which allow both students and lecturers to post and reply to messages, and read comments from other users.\n\nLast but not least are productivity tools in LMS, which include document management systems, calendars, surveys and others. Document management systems allow lecturers and students to upload and download files from any computer that is connected to the internet. Other management tools in LMS collect information on how much students access the LMS and on students’ performance. Several LMS allow students to see a report of their overall performance, such as grades for each assignment, quiz and exam. The summary of LMS tools is represented in Diagram 1."
    },
    {
      "heading": "II. AIM OF STUDY",
      "text": "The aim of this paper is to discuss a number of potential Learning Management Systems (LMS) that can be utilised for teaching and learning processes in the context of Higher Education Institutions and to make a comparison between these LMS platforms in terms of several characteristics such as flexibility, ease of use, accessibility, user friendliness, ability to integrate with other systems and others.\n\n56    http://www.i-jet.org\n\n\nPAPER"
    },
    {
      "heading": "CHOOSING THE RIGHT LEARNING MANAGEMENT SYSTEM (LMS) FOR THE HIGHER EDUCATION INSTITUTION CONTEXT…"
    },
    {
      "heading": "III. LMS PLATFORMS",
      "text": "There are two types of platform for LMS: open source and commercial. There are many open source platforms, such as Moodle, Sakai, ATutor, Claroline, MyGuru2, and MyLMS. Meanwhile, examples of commercial LMS are Blackboard, SuccessFactors, SumTotal, Litmos, Geo learning, Cornerstone and Connect Edu. For the purposes of this paper, however, we will focus on three LMS from each category, i.e. open source and commercial."
    },
    {
      "heading": "A. Moodle",
      "text": "The first open source platform to be considered is Moodle. Moodle is an abbreviation of Modular Object-Oriented Dynamic Learning Environment. It is an LMS that was developed in 2001 and is based on the social constructionist pedagogical principle. It is developed under the terms of a GNU General Public License (GPL), which means that any changes can be made to the source code as long as the original license is not changed [11];[23];[24]. The characteristics of the Moodle platform are user-friendliness, accessibility, and flexibility. There is also a list of students on each course allowing the lecturer to know the last time each student accessed the platform, the ability to integrate Moodle into other systems, the ability to allow synchronous and asynchronous interaction, a personal area for draft writing and journaling as well as managing personal and private information, and content that develops based on the teaching and learning needs and that can be reused."
    },
    {
      "heading": "B. Sakai",
      "text": "The Sakai platform has been developed for community and LMS purposes, and the software has been designed to support learning, teaching, research and cooperation. The software was developed in 2004, and the latest version is Sakai 10.5, which was developed in 2014 [25];[26];[27]. Sakai was developed under the terms of an open source license [28]. The characteristics of the Sakai platform are user-friendliness, ease of use, flexibility, and compatibility with Web 2.0 tools. The tools of Sakai are strengthened by a design tool for teaching and an e-portfolio. In addition, this software has been translated into more than 20 languages, allows synchronous and asynchronous interaction, and offers a personal area for draft writing and journaling as well as managing personal and private information."
    },
    {
      "heading": "C. ATutor",
      "text": "The ATutor platform is an LMS that is based on open source web technology used to develop and present online courses [29]. The leader can copy, distribute and edit the ATutor under the public licensing conditions of a GNU General Public License (GPL). The key characteristic of ATutor is its accessibility, as it ensures that users are able to participate in activities as students, instructors and administrators. In addition, the use of IMS/ISO for support allows students to adapt the environment and the content to the needs of their courses. Instructors and students are able to manage their ATutor courses, and users can send and receive personal messages from other users. Each user has their own file storing utility, and this storage can be shared with other users. Thus, all the content and the course structure can be stored and backed up in ATutor."
    },
    {
      "heading": "D. Blackboard",
      "text": "The first commercial platform considered is Blackboard. Blackboard is an LMS that supports the needs of students, faculty and the institution [30]. This system is a licensed system, and the institutions that use this system must pay for annual license renewal [11]. The price of Blackboard depends on the needs of the institution [31]. If the institution requires maintenance or improvement to Blackboard, the cost will be charged. Blackboard cannot be integrated with other systems [11];[31]. Even though this system is a bit complex and expensive, it is fully equipped and has a lot of tools and services available in the Blackboard suite. Ref. [31] states that the connection to the Building Blocks of Blackboard adds additional functions."
    },
    {
      "heading": "E. SuccessFactors",
      "text": "The second commercial platform is SuccessFactors, which is an LMS that makes easy the development, utilisation, and management of learning courses [32]. This\n\niJET ‒ Volume 11, Issue 6, 2016    57\n\nPAPER"
    },
    {
      "heading": "CHOOSING THE RIGHT LEARNING MANAGEMENT SYSTEM (LMS) FOR THE HIGHER EDUCATION INSTITUTION CONTEXT…",
      "text": "system is based on the Cloud, and has characteristics such as automatic assignment profiles, structured programmes, and elements of e-signature support. SuccessFactors provides a lot of functionalities, is flexible and facilitates the learning of users. This system is suitable for the field of human resources. The administrator is able to restrict users’ access, or give certain roles to several users depending on the course development [33]."
    },
    {
      "heading": "F. SumTotal",
      "text": "The third commercial platform is SumTotal. The function of this system is more towards the human resources field. There are four versions of SumTotal: SumTotal Learn, SumTotal Talent, SumTotal Work, and SumTotal elix HR. SumTotal Learn is an LMS that provides personal and contextual learning to help employees work better [34]. SumTotal Talent is able to identify hidden talents and abilities among consumers, and can also provide tools to help users become more productive. The role of SumTotal Work is to improve the efficiency and effectiveness of all aspects of workforce management, including salary and expense management. SumTotal elix HR gives an overall assessment of a company’s human resources data. The function of elix HR is to extend and connect information about HR processes, to integrate data, systems and processes from different HR and business applications to present a global view of the workforce."
    },
    {
      "heading": "IV. COMPARISON BETWEEN LMS PLATFORMS",
      "text": "Table 1 provides a comparison between the LMS platforms reviewed. Table 1 shows that not all platforms can be integrated with other systems. The only three platforms that can be integrated with other systems are Moodle, Sakai and SumTotal. The integration of e-learning systems with other systems can allow users to access and use the e-learning facilities provided. In terms of synchronously and asynchronous interactions, there are four platforms that enable either synchronous or asynchronous interactions: Moodle, Sakai, ATutor, and Blackboard. Meanwhile, only two platforms have a private area for writing drafts and journaling, and manage personal and private information: Moodle and Sakai. In Moodle and Sakai, users can see who is online. There are four platforms that allow users to send and receive private messages, which are Moodle, Sakai, ATutor and SuccessFactors.\n\nThe main difference between open source and commercial platforms is in terms of licensing fees: commercial LMS require licensing fees per user, usually on an annual basis, with a subscription and maintenance fee on top to make sure the LMS is kept up to date. Open source LMS platforms do not require a licensing fee, as they are developed under a GNU General Public License (GPL), and users only need to download the code. Open source platforms therefore provide freedom, in that modifications can be made to the source code according to users’ needs, and the institution has the ability to change the provider in the future if they want a better service. However, a commercial platform cannot be modified according to users’ needs because commercial LMS are typically designed in accordance with a set of standards. This difference is significant and will influence the selection of a specific platform because in LMS selection, it is important for an organisation to consider how it plans to deliver training materials to the students, and the features of the LMS must meet the requirements of the organisation.\n\n58    http://www.i-jet.org\n\n\nPAPER\nCHOOSING THE RIGHT LEARNING MANAGEMENT SYSTEM (LMS) FOR THE HIGHER EDUCATION INSTITUTION CONTEXT…"
    },
    {
      "heading": "VI. DISCUSSION",
      "text": "An LMS is a web-based software package that is designed to plan, implement and evaluate learning, facilitate student interaction, give performance feedback and manage students’ activities. One of the important elements of an LMS is the ability to optimally improve the learning quality and implement an interactive learning system. Commercial LMS platforms can have two types of host: server-based and Cloud-based. For server-based LMS, the data is stored in a local network that is the organisation’s server, which can be changed according to the LMS. Meanwhile, Cloud-based LMS keep the data in the Cloud, and thus the internet is needed to enter the system and to be able to access it from anywhere.\n\nThere are two types of LMS, open source and commercial, and each organisation faces the dilemma to choose either open source or commercial. Each platform has its own benefits and advantages, so LMS platforms should be chosen based on the needs of the users. Commercial LMS may be easy to develop and use, but have a high cost. Meanwhile open source LMS are free, but maintenance and improvement cost will be charged.\n\nThe crucial factor that impacts on student satisfaction is that the features available in an LMS meet their needs and facilitate its use. For example, the integration of an e-learning system with other complementary systems is a strength of an e-learning system, for example an information management system provides systematic and interactive elements that can easily be managed in the LMS and supported by its flexibility and student-centeredness, and it is thus able to provide a more meaningful learning experiences for students. The features that have been described can have an impact on the selection of an LMS by a university. These characteristics are extremely important for the administrator to know to make the right choice of the platform that will meet the needs of the students, the teaching and learning objectives and will facilitate a social learning environment for students.\n\nEach LMS has different criteria, so to make a choice of which system to use, every criterion needs to be observed according to the needs of the users and the course. The first step is to think about the needs of users and courses, the second is to consider the purpose for which the LMS was developed, and the third is to ensure that the LMS is user-friendly, flexible, and able to integrate with other systems that helps students with managing their learning and personal needs. An evaluation of the LMS platforms then needs to be done. For example, if there is only one course leader who is responsible for sending and editing the content perhaps only a cheap system is needed."
    },
    {
      "heading": "V. CHARACTERISTICS OF LEARNING MANAGEMENT SYSTEMS",
      "text": "LMS have has positive characteristics such as user-friendliness, flexibility, openness and others. An LMS is an informal student-centred learning environment, which supports the social and personal needs of students, facilitates feedback and, most importantly, is interactive [35]. In addition, if the LMS system is integrated with other systems such as e-portfolios, Web 2.0, email systems, mobile learning services and other systems used at universities, it can facilitate students’ learning, and facilitate students to use the LMS [11]. The most important charac-\n\n| LMS                                                                                                                     | Open Source | Commercial |        |            |                |     |\n| ----------------------------------------------------------------------------------------------------------------------- | ----------- | ---------- | ------ | ---------- | -------------- | --- |\n| Characteristics                                                                                                         | Moodle      | Sakai      | ATutor | Blackboard | SuccessFactors | Sum |\n| Success Factors                                                                                                         | Total       |            |        |            |                |     |\n| Flexible                                                                                                                |             |            |        |            |                |     |\n| Easy to use                                                                                                             |             |            |        |            |                |     |\n| Able to integrate with other systems                                                                                    |             |            |        |            |                |     |\n| Accessible                                                                                                              |             |            |        |            |                |     |\n| User-friendly                                                                                                           |             |            |        |            |                |     |\n| Synchronous and asynchronous interaction                                                                                |             |            |        |            |                |     |\n| Able to see who is online                                                                                               |             |            |        |            |                |     |\n| Personal space for draft writing and journals, as well as managing personal and private information                     |             |            |        |            |                |     |\n| Able to send and receive personal messages with other users                                                             |             |            |        |            |                |     |\n| Lecturers and students able to adapt and manage the courses in the software                                             |             |            |        |            |                |     |\n| Each user has file storing utility and the storage can be shared with other users                                       |             |            |        |            |                |     |\n| The entire content and course structure can be stored and backed up in the software                                     |             |            |        |            |                |     |\n| Administrator can restrict user access or give multiple roles to multiple users                                         |             |            |        |            |                |     |\n| Provides contextual learning, able to identify talent, improve the efficiency and effectiveness of workforce management |             |            |        |            |                |     |"
    },
    {
      "heading": "VII. CONCLUSION",
      "text": "Based on the results of past studies, we can conclude that there are six platforms that are being used by Malaysian institutions. The platforms are Moodle, Sakai, ATutor, Blackboard, SuccessFactors and SumTotal. One of the most important characteristics is...\n\niJET ‒ Volume 11, Issue 6, 2016    59"
    },
    {
      "heading": "PAPER"
    },
    {
      "heading": "CHOOSING THE RIGHT LEARNING MANAGEMENT SYSTEM (LMS) FOR THE HIGHER EDUCATION INSTITUTION CONTEXT…",
      "text": "Six platforms, SumTotal, functions more in the human resources field compared to the other platforms, which support online learning management. Each platform has its own uniqueness. Institutions or lecturers that want to use a platform for online learning management have the right to choose the platform according to the specifications and needs of the users. This is because each platform has its own characteristics, can be accessed anywhere and anytime, and is able to handle the learning and the personal needs of the users.\n\nOpen source platforms are becoming a choice for every institution, as they are beneficial to users in allowing platforms to be modified according to user requirements, and because of the low costs charged to get a better service, compared to a commercial platform that requires licensing fees per user, with an additional subscription and maintenance fee to make sure your LMS is kept up to date. Moodle is the recommended open source platform because it has a lot of features that meet the needs of students and it has had more than 80 million users. For institutions that have larger budgets and want to use an LMS that meets all the requirements, Blackboard is recommended."
    },
    {
      "heading": "REFERENCES",
      "text": "1. Kementerian Pendidikan Malaysia, “Laporan Awal Pelan Pembangunan Pendidikan Malaysia 2013-2025,” 2012.\n2. Kementerian Pengajian Tinggi Malaysia, “Dasar E-Pembelajaran Negara Institusi Pengajian Tinggi,” 2011.\n3. R. M. M Yusoff et al., “Tahap Kesediaan Pelajar Dalam Penggunaan Teknologi, Pedagogi, Dan Kandungan (TPACK) Dalam Pembelajaran Kurikulum Di IPT,” in Proceeding of the 3ʳᵈ International Conference on Artifical Intelligence and Computer Science (AICS2015)., Penang., Malaysia, 2015, pp. 307–315.\n4. M. A. Embi, in Amalan, Keberkesanan &#x26; Cabaran Pelaksanaaan E-Pembelajaran Di IPT Malaysia, 1ˢᵗ ed, Putrajaya, Malaysia: Jabatan Pengajian Tinggi, Kementerian Pengajian Tinggi Malaysia. 2010.\n5. F. Khalid et al., “Pemilihan Aplikasi Teknologi Sebagai Medium Perkongsian Maklumat Oleh Pelajar Siswazah Universiti,” in ASEAN Comparative Education Research Network Conference., 2015, pp. 2011–2027.\n6. Adobe. (2009, April 04). Adobe Solutions for Learning Management Systems (LMS) [online]. Available: https://www.adobe.com/content/dam/Adobe/en/education/pdfs/lms-primer-102909.pdf.\n7. R. Nasser et al., “Factors That Impact Student Usage of the Learning Management System in Qatari Schools,” in International Review of Research in Open and Distance Learning., Qatar., 2011, vol. 12, issue 6, pp. 39–62.\n8. N. Srichanyachon, “Efl Learners ’ Perceptions of Using LMS,” Turkish Online Journal of Educational Technology., 2014, vol. 13, issue 4, pp. 30–35.\n9. H. Coates et al., “A Critical Examination of the Effects of Learning Management Systems on University Teaching and Learning,” Tertiary Education and Management., 2005, vol. 11, issue 1, pp. 19–36. http://dx.doi.org/10.1080/13583883.2005.9967137\n10. T. Jurubescu, “Learning Content Management Systems,” Informatica Economica., 2008, vol. 12, issue 4, pp. 91–94.\n11. M. A. Embi and M. N. Adun, in E-Pembelajaran Di IPTA Malaysia, 1ˢᵗ ed, UKM Bangi., Malaysia: Pusat Pembangunan Akademik Universiti Kebangsaan Malaysia &#x26; Jabatan Pengajian Tinggi Kementerian Pengajian Tinggi Malaysia, 2010.\n12. D. McIntosh, “Vendors of Learning Management and E-Learning Products,” Learning Management Vendors., 2015, pp. 1-223.\n13. A. Altun et al., “Use of a Content Management System for Blended Learning: Perceptions of Pre-Service Teachers,” Turkish Online Journal of Distance Education., 2008, vol. 9, issue 4, pp. 138–53.\n\n60    http://www.i-jet.org\n\n\n\n\nPAPER"
    },
    {
      "heading": "CHOOSING THE RIGHT LEARNING MANAGEMENT SYSTEM (LMS) FOR THE HIGHER EDUCATION INSTITUTION CONTEXT…",
      "text": "[36] Jacksonville University. (2016, January 12). Blackboard Learn [online]. Available: https://blackboard.ju.edu/webapps/portal/execute/tabs/tabAction?t ab_tab_group_id=_1_1."
    },
    {
      "heading": "AUTHORS",
      "text": "N. N. M. Kasim is with the Faculty of Education, Universiti Kebangsaan Malaysia, 43600 UKM Bangi, Selangor, Malaysia. (nurulnadirahmohdkasim@gmail.com). Currently a master student of Resource and Information Technology Education in UKM.\n\nF. Khalid is a senior lecturer at the Faculty of Education, Universiti Kebangsaan Malaysia. She received her PhD from The University of Nottingham in Instructional Technology. Her areas of research are: online communities of practice, identities in communities, and Innovations in ICT use for education. She is currently an e-Learning Coordinator for the Faculty of Education. (fariza.khalid@ukm.edu.my).\n\nSubmitted 14 March 2016. Published as resubmitted by the authors 26 May 2016.\n\niJET ‒ Volume 11, Issue 6, 2016 61"
    }
  ],
  "images": [
    {
      "page": 2,
      "path": "C:\\Users\\Irena\\Desktop\\Emt_lovable\\app\\fastAPI\\runs\\20250909-091538-354031\\3-images\\page_2_img_1.jpg"
    },
    {
      "page": 3,
      "path": "C:\\Users\\Irena\\Desktop\\Emt_lovable\\app\\fastAPI\\runs\\20250909-091538-354031\\3-images\\page_3_img_1.jpg"
    },
    {
      "page": 3,
      "path": "C:\\Users\\Irena\\Desktop\\Emt_lovable\\app\\fastAPI\\runs\\20250909-091538-354031\\3-images\\page_3_img_2.jpg"
    },
    {
      "page": 3,
      "path": "C:\\Users\\Irena\\Desktop\\Emt_lovable\\app\\fastAPI\\runs\\20250909-091538-354031\\3-images\\page_3_img_3.jpg"
    },
    {
      "page": 4,
      "path": "C:\\Users\\Irena\\Desktop\\Emt_lovable\\app\\fastAPI\\runs\\20250909-091538-354031\\3-images\\page_4_img_1.jpg"
    },
    {
      "page": 4,
      "path": "C:\\Users\\Irena\\Desktop\\Emt_lovable\\app\\fastAPI\\runs\\20250909-091538-354031\\3-images\\page_4_img_2.jpg"
    },
    {
      "page": 4,
      "path": "C:\\Users\\Irena\\Desktop\\Emt_lovable\\app\\fastAPI\\runs\\20250909-091538-354031\\3-images\\page_4_img_3.jpg"
    },
    {
      "page": 5,
      "path": "C:\\Users\\Irena\\Desktop\\Emt_lovable\\app\\fastAPI\\runs\\20250909-091538-354031\\3-images\\page_5_img_1.jpg"
    },
    {
      "page": 5,
      "path": "C:\\Users\\Irena\\Desktop\\Emt_lovable\\app\\fastAPI\\runs\\20250909-091538-354031\\3-images\\page_5_img_2.jpg"
    }
  ],
  "authors": []
}